{
  "title": "Duda",
  "webMarketShare": 0.6,
  "cmsMarketShare": 0.8,
  "architecture": {
    "paradigm": "SaaS",
    "serverAdminRequired": false,
    "backendLanguage": "Javascript",
    "extensionLanguageTech": ["Javascript", "HTML", "CSS"],
    "frontendLanguageTech": ["Javascript"],
    "contentStorage": ["NoSQL"],
    "hostingOptions": ["managed"],
    "apiOptions": ["REST"],
    "summary": "Duda is a SaaS-based website builder that abstracts server management, utilizing Javascript for backend operations. It supports extensions through Javascript, HTML, and CSS, and offers managed hosting with RESTful API integrations."
  },
  "targetUsers": {
    "individualHobbyist": "kinda",
    "singleDeveloper": "yes",
    "smallDevelopmentTeam": "yes",
    "largeDevelopmentTeam": "kinda",
    "singleContentEditor": "yes",
    "smallContentTeam": "yes",
    "largeContentTeam": "kinda",
    "enterpriseCorporation": "kinda",
    "summary": "Duda caters primarily to single developers, small teams, and content editors, offering features suitable for small to medium-sized projects. While it provides tools for larger teams and enterprises, its capabilities are more aligned with smaller-scale operations."
  },
  "legal": {
    "softwareLicense": "proprietary",
    "corporateStructure": "commercial",
    "summary": "Duda operates under a proprietary software license as a commercial entity, offering its platform through subscription-based plans."
  },
  "userManagement": {
    "paradigm": ["self-contained"],
    "summary": "Duda includes built-in user management, allowing administrators to manage team members and client permissions within the platform."
  },
  "contentEditing": {
    "paradigm": "drag and drop",
    "onSiteEditing": "yes",
    "customFields": "yes",
    "customContentTypes": "yes",
    "versioning": "kinda",
    "previewing": "yes",
    "editingWorkflows": "kinda",
    "realTimeCollaboration": "kinda",
    "summary": "Duda offers a drag-and-drop editor with on-site editing capabilities, supporting custom fields and content types. While it provides basic versioning and workflow features, real-time collaboration tools are limited."
  },
  "contentDisplay": {
    "frontendDeveloperRequired": "no",
    "supportsPackagedThemes": "yes",
    "themeMarketplace": "yes",
    "paidThemes": "yes",
    "supportsOnSiteDisplayCustomization": "yes",
    "summary": "Duda provides a variety of packaged themes through its marketplace, including paid options. Users can customize site displays without requiring frontend development expertise."
  },
  "mobileSupport": {
    "isResponsiveDesign": "yes",
    "createsPWA": "no",
    "createsNativeApp": "no",
    "summary": "Duda ensures responsive design for optimal viewing across devices but does not natively support the creation of Progressive Web Apps (PWAs) or native mobile applications."
  },
  "internationalization": {
    "multilingualContent": "yes",
    "multilingualUI": "yes",
    "multilingualEditor": "yes",
    "summary": "Duda supports multilingual content, user interface, and editor, facilitating website creation and management in multiple languages."
  },
  "extensibility": {
    "backendDeveloperRequired": "no",
    "extensionMarketplace": "yes",
    "paidExtensions": "yes",
    "summary": "Duda offers an extension marketplace with both free and paid options, allowing users to enhance site functionality without requiring backend development skills."
  },
  "commerce": {
    "isInCore": "no",
    "isInExtensions": "yes",
    "integratedPlatforms": ["Ecwid"],
    "integratedPaymentGateways": ["PayPal", "Stripe", "Square"],
    "summary": "E-commerce functionality in Duda is available through extensions, notably integrating with platforms like Ecwid, and supports payment gateways such as PayPal, Stripe, and Square."
  },
  "costs": {
    "paradigm": ["per site", "subscription"],
    "subscription": 19,
    "softwareLicense": 0,
    "estimatedYearOneTotal": 228,
    "summary": "Duda operates on a subscription model, starting at $19 per month per site when billed annually, totaling approximately $228 for the first year. Higher-tier plans with additional features are available at increased subscription rates."
  }
}
