{
  "title": "Shopware",
  "architecture": {
    "paradigm": "server install",
    "serverAdminRequired": true,
    "backendLanguage": "PHP",
    "extensionLanguageTech": ["PHP", "JavaScript"],
    "frontendLanguageTech": ["HTML", "CSS", "JavaScript", "Twig"],
    "contentStorage": ["SQL"],
    "hostingOptions": ["shared", "vps", "managed"],
    "apiOptions": ["REST"],
    "summary": "Shopware is an open-source e-commerce platform requiring server installation and administration. Built with PHP, it utilizes SQL databases for content storage. Frontend customization employs HTML, CSS, JavaScript, and Twig templating. The platform offers a REST API for integration and can be extended using plugins developed in PHP and JavaScript. Hosting options include shared, VPS, and managed servers."
  },
  "targetUsers": {
    "individualHobbyist": "kinda",
    "singleDeveloper": "yes",
    "smallDevelopmentTeam": "yes",
    "largeDevelopmentTeam": "yes",
    "singleContentEditor": "kinda",
    "smallContentTeam": "yes",
    "largeContentTeam": "yes",
    "enterpriseCorporation": "yes",
    "summary": "Shopware caters to a broad spectrum of users, from single developers to large enterprise teams. Its scalability and flexibility make it suitable for small to large development teams and content management groups. Individual hobbyists or single content editors may require technical expertise to fully leverage its capabilities."
  },
  "legal": {
    "softwareLicense": "open-source: MIT",
    "corporateStructure": "commercial",
    "summary": "Shopware is open-source software licensed under the MIT License. It is developed and maintained by shopware AG, a commercial company based in Germany."
  },
  "userManagement": {
    "paradigm": ["self-contained"],
    "summary": "Shopware includes a comprehensive user management system, allowing administrators to manage user roles, permissions, and access controls within the platform."
  },
  "contentEditing": {
    "paradigm": "web form",
    "onSiteEditing": "yes",
    "customFields": "yes",
    "customContentTypes": "yes",
    "versioning": "kinda",
    "previewing": "yes",
    "editingWorkflows": "kinda",
    "realTimeCollaboration": "no",
    "summary": "Shopware offers a web-based editor for content creation and management, supporting on-site editing, custom fields, and content types. It includes previewing capabilities and basic versioning and workflow management, though these features may require additional configuration or extensions. Real-time collaboration is not a native feature."
  },
  "contentDisplay": {
    "frontendDeveloperRequired": "kinda",
    "supportsPackagedThemes": "yes",
    "themeMarketplace": "yes",
    "paidThemes": "yes",
    "supportsOnSiteDisplayCustomization": "yes",
    "summary": "Shopware provides support for packaged themes, with a marketplace offering both free and paid options. While basic customization can be performed without extensive frontend development skills, advanced customization and development of unique designs may require frontend development expertise."
  },
  "mobileSupport": {
    "isResponsiveDesign": "yes",
    "createsPWA": "no",
    "createsNativeApp": "no",
    "summary": "Shopware supports responsive design, ensuring online stores are accessible across various devices. However, it does not natively support the creation of Progressive Web Apps (PWAs) or native mobile applications."
  },
  "internationalization": {
    "multilingualContent": "yes",
    "multilingualUI": "yes",
    "multilingualEditor": "yes",
    "summary": "Shopware supports multilingual content, user interfaces, and editors, allowing for the creation and management of online stores in multiple languages to cater to a global audience."
  },
  "extensibility": {
    "backendDeveloperRequired": "kinda",
    "extensionMarketplace": "yes",
    "paidExtensions": "yes",
    "summary": "Shopware offers an extension marketplace with various plugins, both free and paid, to enhance functionality. While many extensions can be implemented without backend development, advanced customizations or the creation of bespoke plugins may require developer expertise."
  },
  "commerce": {
    "isInCore": "yes",
    "isInExtensions": "yes",
    "integratedPlatforms": ["PayPal", "Stripe"],
    "integratedPaymentGateways": ["PayPal", "Stripe"],
    "summary": "E-commerce functionality is central to Shopware, with core features supporting online store operations. Additional capabilities can be added via extensions. The platform integrates with various payment gateways, including PayPal and Stripe."
  },
  "costs": {
    "paradigm": ["free", "subscription"],
    "subscription": 0,
    "softwareLicense": 0,
    "estimatedYearOneTotal": 0,
    "summary": "Shopware offers a Community Edition that is free to use under the MIT License. For advanced features and official support, there are subscription-based commercial editions available. Additional costs may include hosting services, premium plugins, themes, and professional support or development services."
  }
}
